; domain
(define (domain emergency)
  (:predicates
   (ambulance ?a) ; Ambulancia
   (at ?a ?l)     ; Si la ambulancia/paciente está en un lugar
   (carry ?p ?a)  ; Si el paciente está en la ambulancia
   (current ?l)   ; La ubicación current de la ambulancua
   (free ?a)      ; Si está vacía la ambulancia
   (location ?l)  ; Los lugares
   (path ?f ?t)   ; Camino entre dos lugares
   (patient ?p))  ; Paciente
  (:action move
	   :parameters (?from ?to)
	   :precondition (and
			  (current ?from)
			  (location ?from)
			  (location ?to)
			  (path ?from ?to))
	   :effect (and
		    (current ?to)
		    (not (current ?from))))
  (:action getinto
	   :parameters (?p ?l ?a)
	   :precondition (and
			  (ambulance ?a)
			  (at ?p ?l)
			  (current ?l)
			  (free ?a)
			  (location ?l)
			  (patient ?p))
	   :effect (and
		    (carry ?p ?a)
		    (not (at ?p ?l))
		    (not (free ?a))))
  (:action getout
	   :parameters (?p ?l ?a)
	   :precondition (and
			  (ambulance ?a)
			  (carry ?p ?a)
			  (current ?l)
			  (location ?l)
			  (patient ?p))
	   :effect (and
		    (at ?p ?l)
		    (free ?a)
		    (not (carry ?p ?a)))))

; problem
(define (problem original)
  (:domain emergency)
  (:objects ambulance hospital L2 L3 L4 L5 L6 L7 patient1 patient2 patient3)
  (:init
   (ambulance ambulance)
   (at patient1 L3)
   (at patient2 L6)
   (at patient3 L7)
   (current hospital)
   (free ambulance)
   (location L2)
   (location L3)
   (location L4)
   (location L5)
   (location L6)
   (location L7)
   (location hospital)
   (path L2 L3)
   (path L2 L4)
   (path L2 L5)
   (path L2 hospital)
   (path L3 L2)
   (path L3 L6)
   (path L3 L7)
   (path L4 L2)
   (path L4 L6)
   (path L5 L2)
   (path L5 L7)
   (path L6 L3)
   (path L6 L4)
   (path L7 L3)
   (path L7 L5)
   (path hospital L2)
   (patient patient1)
   (patient patient2)
   (patient patient3))
  (:goal (and
          (at patient1 hospital)
          (at patient2 hospital)
	  (at patient3 hospital))))

; plan
1. (move hospital l2)
   deleted: (current hospital)
   added: (current l2)
   goals met: 0 of 3
2. (move l2 l3)
   deleted: (current l2)
   added: (current l3)
   goals met: 0 of 3
3. (getinto patient1 l3 ambulance)
   deleted: (at patient1 l3) (free ambulance)
   added: (carry patient1 ambulance)
   goals met: 0 of 3
4. (move l3 l2)
   deleted: (current l3)
   added: (current l2)
   goals met: 0 of 3
5. (move l2 hospital)
   deleted: (current l2)
   added: (current hospital)
   goals met: 0 of 3
6. (getout patient1 hospital ambulance)
   deleted: (carry patient1 ambulance)
   added: (at patient1 hospital) (free ambulance)
   goals met: 1 of 3
7. (move hospital l2)
   deleted: (current hospital)
   added: (current l2)
   goals met: 1 of 3
8. (move l2 l3)
   deleted: (current l2)
   added: (current l3)
   goals met: 1 of 3
9. (move l3 l6)
   deleted: (current l3)
   added: (current l6)
   goals met: 1 of 3
10. (getinto patient2 l6 ambulance)
   deleted: (at patient2 l6) (free ambulance)
   added: (carry patient2 ambulance)
   goals met: 1 of 3
11. (move l6 l3)
   deleted: (current l6)
   added: (current l3)
   goals met: 1 of 3
12. (move l3 l2)
   deleted: (current l3)
   added: (current l2)
   goals met: 1 of 3
13. (move l2 hospital)
   deleted: (current l2)
   added: (current hospital)
   goals met: 1 of 3
14. (getout patient2 hospital ambulance)
   deleted: (carry patient2 ambulance)
   added: (at patient2 hospital) (free ambulance)
   goals met: 2 of 3
15. (move hospital l2)
   deleted: (current hospital)
   added: (current l2)
   goals met: 2 of 3
16. (move l2 l3)
   deleted: (current l2)
   added: (current l3)
   goals met: 2 of 3
17. (move l3 l7)
   deleted: (current l3)
   added: (current l7)
   goals met: 2 of 3
18. (getinto patient3 l7 ambulance)
   deleted: (at patient3 l7) (free ambulance)
   added: (carry patient3 ambulance)
   goals met: 2 of 3
19. (move l7 l3)
   deleted: (current l7)
   added: (current l3)
   goals met: 2 of 3
20. (move l3 l2)
   deleted: (current l3)
   added: (current l2)
   goals met: 2 of 3
21. (move l2 hospital)
   deleted: (current l2)
   added: (current hospital)
   goals met: 2 of 3
22. (getout patient3 hospital ambulance)
   deleted: (carry patient3 ambulance)
   added: (at patient3 hospital) (free ambulance)
   goals met: 3 of 3
